Tekla.Structures.Model.RebarSet
The RebarSet class represents a set of reinforcing bars.
The following example shows how to create a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create rebarset
var rebarSet = new RebarSet();
rebarSet.RebarProperties.Name = "RebarSet Test";
rebarSet.RebarProperties.Grade = "The Grade";
rebarSet.RebarProperties.BendingRadius = 42.0;
rebarSet.RebarProperties.Class = 7;
rebarSet.RebarProperties.Size = "16";
rebarSet.LayerOrderNumber = 17;
// Create leg face 1
var legFace1 = new RebarLegFace
{
LayerOrderNumber = 2,
AdditonalOffset = 25.0,
Reversed = false
};
legFace1.Contour.AddContourPoint(new ContourPoint(new Point(0, 0, 0), null));
legFace1.Contour.AddContourPoint(new ContourPoint(new Point(800, 0, 0), null));
legFace1.Contour.AddContourPoint(new ContourPoint(new Point(800, 1200, 0), null));
legFace1.Contour.AddContourPoint(new ContourPoint(new Point(0, 1200, 0), null));
// Add leg face 1
rebarSet.LegFaces.Add(legFace1);
// Create leg face 2
var legFace2 = new RebarLegFace
{
LayerOrderNumber = 2,
AdditonalOffset = 25.0,
Reversed = false
};
legFace2.Contour.AddContourPoint(new ContourPoint(new Point(0, 0, 0), null));
legFace2.Contour.AddContourPoint(new ContourPoint(new Point(0, 0, 500), null));
legFace2.Contour.AddContourPoint(new ContourPoint(new Point(0, 1200, 500), null));
legFace2.Contour.AddContourPoint(new ContourPoint(new Point(0, 1200, 0), null));
//  Add leg face 2
rebarSet.LegFaces.Add(legFace2);
// Create the guideline
var guideline = new RebarGuideline();
guideline.Spacing = RebarSpacing.Create(
RebarSpacing.SpacingType.EXACT_FLEXIBLE_LAST,
new RebarSpacing.Offset(true, 0.0),
new RebarSpacing.Offset(true, 0.0),
200.0);
guideline.Curve.AddContourPoint(new ContourPoint(new Point(0.0, 0.0, 0.0), null));
guideline.Curve.AddContourPoint(new ContourPoint(new Point(0.0, 1200, 0.0), null));
rebarSet.Guidelines.Add(guideline);
rebarSet.Insert();
}
}

Tekla.Structures.Model.RebarSet.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarSet class.

Tekla.Structures.Model.RebarSet.RebarProperties
Gets or sets the reinforcing bar properties for the rebar set.

Tekla.Structures.Model.RebarSet.LegFaces
Gets or sets the rebar set's leg faces.

Tekla.Structures.Model.RebarSet.Guidelines
Gets or sets the rebar set's guidelines.

Tekla.Structures.Model.RebarSet.LayerOrderNumber
Gets or sets the layer order number.
If set to 0 this means use the creation date/time of the rebar set object to determine the layering.

Tekla.Structures.Model.RebarSet.BarOrientation
Gets or sets the bar orientation line. If this is non-null, then it is used to orient the bar planes such
that the line is parallel to all the planes.

Tekla.Structures.Model.RebarSet.FatherPart
Gets or sets the father part for the rebar set bars. If set, overrides the automatic bar parenting.

Tekla.Structures.Model.RebarSet.CloseShape
Gets or sets a value indicating whether disconnected bar legs should be connected
where possible to form a closed shape.

Tekla.Structures.Model.RebarSet.FrozenState
Gets or sets the current frozen state of the object.

Tekla.Structures.Model.RebarSet.Offsets
Gets the offset values applied to the whole rebar set.

Tekla.Structures.Model.RebarSet.Insert
Inserts the rebar set into the model database.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.RebarSet.Modify
Modifies the rebar set in the model database to match the current one.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.RebarSet.Delete
Deletes the rebar set instance with the given identifier from the model database.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.RebarSet.Select
Selects the rebar set from the model database. The rebar set identifier must be set.
Returns: True if successful, otherwise false.

Tekla.Structures.Model.RebarSet.GetRebarSetAdditions
Returns an enumerator of all child Tekla.Structures.Model.RebarSetAddition objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.RebarSet.GetRebarModifiers
Returns an enumerator of all child Tekla.Structures.Model.BaseRebarModifier objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.RebarSet.GetRebarLegSurfaces
Returns an enumerator of all child Tekla.Structures.Model.RebarLegSurfaceObject objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.RebarSet.GetReinforcements
Returns an enumerator of all the connected Tekla.Structures.Model.SingleRebar objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.RebarSet.GetAssembly
Returns the assembly that the rebar set belongs to.
Returns: The assembly that the rebar set belongs to.

Tekla.Structures.Model.RebarSet.CheckOrientationLine
If orientation line is defined then the points should be different.
Returns: True if the line is not set or is valid.

Tekla.Structures.Model.RebarSet.Clear
Remove all the child objects.